IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_erad_global_regs.xml
<module id="ERAD_GLOBAL_REGS" HW_revision="" description="ERAD GLOBAL Registers">
	<register id="GLBL_EVENT_STAT" width="16" page="1" offset="0x0" internal="0" description="Global Event Status Register">
		<bitfield id="HWBP1" description="Enhanced Bus Comparator (EBC) Module Event Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="HWBP2" description="Enhanced Bus Comparator (EBC) Module Event Status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="HWBP3" description="Enhanced Bus Comparator (EBC) Module Event Status" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="HWBP4" description="Enhanced Bus Comparator (EBC) Module Event Status" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="HWBP5" description="Enhanced Bus Comparator (EBC) Module Event Status" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="HWBP6" description="Enhanced Bus Comparator (EBC) Module Event Status" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="HWBP7" description="Enhanced Bus Comparator (EBC) Module Event Status" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="HWBP8" description="Enhanced Bus Comparator (EBC) Module Event Status" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CTM1" description="Counter Module Event Status" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CTM2" description="Counter Module Event Status" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CTM3" description="Counter Module Event Status" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="CTM4" description="Counter Module Event Status" begin="11" end="11" width="1" rwaccess="R"/>
	</register>
	<register id="GLBL_HALT_STAT" width="16" page="1" offset="0x2" internal="0" description="Global Halt Status Register">
		<bitfield id="HWBP1" description="Enhanced Bus Comparator (EBC) Module Halt Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="HWBP2" description="Enhanced Bus Comparator (EBC) Module Halt Status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="HWBP3" description="Enhanced Bus Comparator (EBC) Module Halt Status" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="HWBP4" description="Enhanced Bus Comparator (EBC) Module Halt Status" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="HWBP5" description="Enhanced Bus Comparator (EBC) Module Halt Status" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="HWBP6" description="Enhanced Bus Comparator (EBC) Module Halt Status" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="HWBP7" description="Enhanced Bus Comparator (EBC) Module Halt Status" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="HWBP8" description="Enhanced Bus Comparator (EBC) Module Halt Status" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CTM1" description="Counter Module Halt Status" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CTM2" description="Counter Module Halt Status" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CTM3" description="Counter Module Halt Status" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="CTM4" description="Counter Module Halt Status" begin="11" end="11" width="1" rwaccess="R"/>
	</register>
	<register id="GLBL_ENABLE" width="16" page="1" offset="0x4" internal="0" description="Global Enable Register">
		<bitfield id="HWBP1" description="Enhanced Bus Comparator (EBC) Module Global Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HWBP2" description="Enhanced Bus Comparator (EBC) Module Global Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="HWBP3" description="Enhanced Bus Comparator (EBC) Module Global Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="HWBP4" description="Enhanced Bus Comparator (EBC) Module Global Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="HWBP5" description="Enhanced Bus Comparator (EBC) Module Global Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="HWBP6" description="Enhanced Bus Comparator (EBC) Module Global Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="HWBP7" description="Enhanced Bus Comparator (EBC) Module Global Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="HWBP8" description="Enhanced Bus Comparator (EBC) Module Global Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CTM1" description="Counter Module Global Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CTM2" description="Counter Module Global Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CTM3" description="Counter Module Global Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CTM4" description="Counter Module Global Enable" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="GLBL_CTM_RESET" width="16" page="1" offset="0x6" internal="0" description="Global Counter Reset">
		<bitfield id="CTM1" description="Global Reset for the counters" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CTM2" description="Global Reset for the counters" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CTM3" description="Global Reset for the counters" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CTM4" description="Global Reset for the counters" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="GLBL_NMI_CTL" width="16" page="1" offset="0x8" internal="0" description="Global Debug NMI control">
		<bitfield id="HWBP1" description="Enhanced Bus Comparator (EBC) non-maskable interrupt enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HWBP2" description="Enhanced Bus Comparator (EBC) non-maskable interrupt enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="HWBP3" description="Enhanced Bus Comparator (EBC) non-maskable interrupt enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="HWBP4" description="Enhanced Bus Comparator (EBC) non-maskable interrupt enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="HWBP5" description="Enhanced Bus Comparator (EBC) non-maskable interrupt enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="HWBP6" description="Enhanced Bus Comparator (EBC) non-maskable interrupt enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="HWBP7" description="Enhanced Bus Comparator (EBC) non-maskable interrupt enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="HWBP8" description="Enhanced Bus Comparator (EBC) non-maskable interrupt enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CTM1" description="Counter  non-maskable interrupt enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CTM2" description="Counter  non-maskable interrupt enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CTM3" description="Counter  non-maskable interrupt enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CTM4" description="Counter  non-maskable interrupt enable" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="GLBL_OWNER" width="16" page="1" offset="0xa" internal="0" description="Global Ownership">
		<bitfield id="OWNER" description="Global Ownership Bits" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="GLBL_EVENT_AND_MASK" width="32" page="1" offset="0xc" internal="0" description="Global Bus Comparator Event AND Mask Register">
		<bitfield id="MASK1_HWBP1" description="Enhanced Bus Comparator (EBC) AND Event Mask1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MASK1_HWBP2" description="Enhanced Bus Comparator (EBC) AND Event Mask1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MASK1_HWBP3" description="Enhanced Bus Comparator (EBC) AND Event Mask1" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MASK1_HWBP4" description="Enhanced Bus Comparator (EBC) AND Event Mask1" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MASK1_HWBP5" description="Enhanced Bus Comparator (EBC) AND Event Mask1" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MASK1_HWBP6" description="Enhanced Bus Comparator (EBC) AND Event Mask1" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MASK1_HWBP7" description="Enhanced Bus Comparator (EBC) AND Event Mask1" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MASK1_HWBP8" description="Enhanced Bus Comparator (EBC) AND Event Mask1" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP1" description="Enhanced Bus Comparator (EBC) AND Event Mask2" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP2" description="Enhanced Bus Comparator (EBC) AND Event Mask2" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP3" description="Enhanced Bus Comparator (EBC) AND Event Mask2" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP4" description="Enhanced Bus Comparator (EBC) AND Event Mask2" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP5" description="Enhanced Bus Comparator (EBC) AND Event Mask2" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP6" description="Enhanced Bus Comparator (EBC) AND Event Mask2" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP7" description="Enhanced Bus Comparator (EBC) AND Event Mask2" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP8" description="Enhanced Bus Comparator (EBC) AND Event Mask2" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP1" description="Enhanced Bus Comparator (EBC) AND Event Mask3" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP2" description="Enhanced Bus Comparator (EBC) AND Event Mask3" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP3" description="Enhanced Bus Comparator (EBC) AND Event Mask3" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP4" description="Enhanced Bus Comparator (EBC) AND Event Mask3" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP5" description="Enhanced Bus Comparator (EBC) AND Event Mask3" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP6" description="Enhanced Bus Comparator (EBC) AND Event Mask3" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP7" description="Enhanced Bus Comparator (EBC) AND Event Mask3" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP8" description="Enhanced Bus Comparator (EBC) AND Event Mask3" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP1" description="Enhanced Bus Comparator (EBC) AND Event Mask4" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP2" description="Enhanced Bus Comparator (EBC) AND Event Mask4" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP3" description="Enhanced Bus Comparator (EBC) AND Event Mask4" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP4" description="Enhanced Bus Comparator (EBC) AND Event Mask4" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP5" description="Enhanced Bus Comparator (EBC) AND Event Mask4" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP6" description="Enhanced Bus Comparator (EBC) AND Event Mask4" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP7" description="Enhanced Bus Comparator (EBC) AND Event Mask4" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP8" description="Enhanced Bus Comparator (EBC) AND Event Mask4" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GLBL_EVENT_OR_MASK" width="32" page="1" offset="0xe" internal="0" description="Global Bus Comparator Event OR Mask Register">
		<bitfield id="MASK1_HWBP1" description="Enhanced Bus Comparator (EBC) OR Event Mask1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MASK1_HWBP2" description="Enhanced Bus Comparator (EBC) OR Event Mask1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MASK1_HWBP3" description="Enhanced Bus Comparator (EBC) OR Event Mask1" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MASK1_HWBP4" description="Enhanced Bus Comparator (EBC) OR Event Mask1" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MASK1_HWBP5" description="Enhanced Bus Comparator (EBC) OR Event Mask1" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MASK1_HWBP6" description="Enhanced Bus Comparator (EBC) OR Event Mask1" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MASK1_HWBP7" description="Enhanced Bus Comparator (EBC) OR Event Mask1" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MASK1_HWBP8" description="Enhanced Bus Comparator (EBC) OR Event Mask1" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP1" description="Enhanced Bus Comparator (EBC) OR Event Mask2" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP2" description="Enhanced Bus Comparator (EBC) OR Event Mask2" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP3" description="Enhanced Bus Comparator (EBC) OR Event Mask2" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP4" description="Enhanced Bus Comparator (EBC) OR Event Mask2" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP5" description="Enhanced Bus Comparator (EBC) OR Event Mask2" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP6" description="Enhanced Bus Comparator (EBC) OR Event Mask2" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP7" description="Enhanced Bus Comparator (EBC) OR Event Mask2" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="MASK2_HWBP8" description="Enhanced Bus Comparator (EBC) OR Event Mask2" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP1" description="Enhanced Bus Comparator (EBC) OR Event Mask3" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP2" description="Enhanced Bus Comparator (EBC) OR Event Mask3" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP3" description="Enhanced Bus Comparator (EBC) OR Event Mask3" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP4" description="Enhanced Bus Comparator (EBC) OR Event Mask3" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP5" description="Enhanced Bus Comparator (EBC) OR Event Mask3" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP6" description="Enhanced Bus Comparator (EBC) OR Event Mask3" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP7" description="Enhanced Bus Comparator (EBC) OR Event Mask3" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="MASK3_HWBP8" description="Enhanced Bus Comparator (EBC) OR Event Mask3" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP1" description="Enhanced Bus Comparator (EBC) OR Event Mask4" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP2" description="Enhanced Bus Comparator (EBC) OR Event Mask4" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP3" description="Enhanced Bus Comparator (EBC) OR Event Mask4" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP4" description="Enhanced Bus Comparator (EBC) OR Event Mask4" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP5" description="Enhanced Bus Comparator (EBC) OR Event Mask4" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP6" description="Enhanced Bus Comparator (EBC) OR Event Mask4" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP7" description="Enhanced Bus Comparator (EBC) OR Event Mask4" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="MASK4_HWBP8" description="Enhanced Bus Comparator (EBC) OR Event Mask4" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GLBL_AND_EVENT_INT_MASK" width="16" page="1" offset="0x10" internal="0" description="Global AND Event Interrupt Mask Register">
		<bitfield id="RTOSINT_MASK1" description="RTOSINT generation mask for global AND events" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RTOSINT_MASK2" description="RTOSINT generation mask for global AND events" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RTOSINT_MASK3" description="RTOSINT generation mask for global AND events" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RTOSINT_MASK4" description="RTOSINT generation mask for global AND events" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="GLBL_OR_EVENT_INT_MASK" width="16" page="1" offset="0x12" internal="0" description="Global OR Event Interrupt Mask Register">
		<bitfield id="RTOSINT_MASK1" description="RTOSINT generation mask for global OR events" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RTOSINT_MASK2" description="RTOSINT generation mask for global OR events" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RTOSINT_MASK3" description="RTOSINT generation mask for global OR events" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RTOSINT_MASK4" description="RTOSINT generation mask for global OR events" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
</module>
